In [1]:
import pandas as pd

data = {'Empresa':['GDOG', 'GDOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Nome':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Venda':[200, 120, 340, 124, 243, 350]}

In [5]:
df = pd.DataFrame(data)

In [8]:
df

  Empresa     Nome  Venda
0    GDOG      Sam    200
1    GDOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Agrupar e realizar a operacao

In [15]:
group = df.groupby('Empresa')

In [17]:
group

Soma das vendas por empresa

In [20]:
group.sum()

               Nome  Venda
Empresa
FB        CarlSarah    593
GDOG     SamCharlie    320
MSFT     AmyVanessa    464

Medoto que apresenta uma serie de metodos pre aplicados

In [27]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GDOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [30]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GDOG        2      2
MSFT        2      2

In [34]:
group = df.groupby('Nome')

In [38]:
group.sum()

        Empresa  Venda
Nome
Amy        MSFT    340
Carl         FB    243
Charlie    GDOG    120
Sam        GDOG    200
Sarah        FB    350
Vanessa    MSFT    124

Total de vendas da Amy

In [42]:
group.sum().loc['Amy']

Empresa    MSFT
Venda       340
Name: Amy, dtype: object